% MMI的结构分析（by：Design of Silicon Photonic Multimode InterferenceCouplers.pdf）
% 1*2型的MMI结构：
% 需要求出mmi里面各阶模的函数方程
%参数设置：(单位：um)
clear
close all
wg_in = 0.5;
mmi_w = 2;  

% 求得TE(软件中的TM)导模的传播常数
%n_si=3.472000;  %index of si
n_si = 2.838691;  %2.5D 等效
n_sio2=1.444000;  %index of sio2
d = 2e-6;   %芯层厚度
lambda = 1.550e-6;
k = 2*pi/lambda;
V = k*d*sqrt(n_si^2-n_sio2^2);
V12 = sqrt(n_si^2-n_sio2^2)*k*d;
V13 = sqrt(n_si^2-n_sio2^2)*k*d;

m_te = floor(1/pi*(V-atan(sqrt((n_sio2^2-n_sio2^2)/(n_si^2-n_sio2^2))))); %TE 导模数
m_tm = floor(1/pi*(V-atan(n_si/n_sio2*(sqrt((n_sio2^2-n_sio2^2)/(n_si^2-n_sio2^2)))))); %TM导模数

F = @(x)(x*(sqrt(V12^2 - x.^2)+sqrt(V13^2-x.^2))./(x.^2 - sqrt(V12^2 - x.^2).*sqrt(V13^2 - x.^2) ));  %定义函数
Feigin = @(x)(F(x)-tan(x));   %采用匿名函数的方法定义TE（软件中的TM）模的特征方程
% 2D  图解法根的近似位置
% x(1) = fzero(Feigin,2.91);          %求解特征方程的第一个数值解
% x(2) = fzero(Feigin,5.825);         %求解特征方程的第二个数值解
% x(3) = fzero(Feigin,8.73);          %求解特征方程的第三个数值解
% x(4) = fzero(Feigin,11.62);         %求解特征方程的第四个数值解
% x(5) = fzero(Feigin,14.5);          %求解特征方程的第一个数值解
% x(6) = fzero(Feigin,20.17);         %求解特征方程的第二个数值解
% x(7) = fzero(Feigin,22.9);          %求解特征方程的第三个数值解
% x(8) = fzero(Feigin,25.4);          %求解特征方程的第四个数值解
% 2.5 D 图解法根的近似值
x(1) = fzero(Feigin,2.85);          %求解特征方程的第一个数值解
x(2) = fzero(Feigin,5.7);         %求解特征方程的第二个数值解
x(3) = fzero(Feigin,8.54);          %求解特征方程的第三个数值解
x(4) = fzero(Feigin,11.35);         %求解特征方程的第四个数值解
x(5) = fzero(Feigin,16.8);          %求解特征方程的第一个数值解
x(6) = fzero(Feigin,19.4);         %求解特征方程的第二个数值解

kappa = x/d;                                        %求出对应的 κ 的数值
theta = asin(kappa/(n_si*k));                       %求出对应的 θ 的数值
beta = (n_si*k)*cos(theta);                         %求出对应的 β 的数值
gamma = sqrt((n_si^2-n_sio2^2)*k^2 - kappa.^2);     %求出对应的 γ 的数值
delta = sqrt((n_si^2-n_sio2^2)*k^2 - kappa.^2);     %求出对应的 δ 的数值
neff_te = beta/k;                %有效折射率

format short g            %设定命令窗口数据显示表格
[x' theta' beta' kappa' gamma' delta' neff_te']
figure;
ezplot(@tan,[0,20*pi,-5,5])     %作出正切函数tan（x）的曲线
hold on
ezplot(F,[0,20*pi])             %作出函数F(x)的曲线
title('图解法求平板光波导的所需的数据')

% 模场归一化分布
Np = 1001; %设置作图的点数
x2 = linspace(-2*d,-d,Np);  %设置介质2中的横坐标范围；
x1 = linspace(-d,0,Np);     %设置介质1中的横坐标范围；
x3 = linspace(0,1*d,Np);    %设置介质3中的横坐标范围；

Ey1 = zeros(Np,3); Ey2 = Ey1; Ey3 = Ey1; %对3段介质中的Ey分别进行初始化
for m = 1:m_te      %循环计算各阶TE模，其中m对应TE模的序数；
    Ey1(:,m) = cos(kappa(m)*x1)-delta(m)/kappa(m)*sin(kappa(m)*x1);  %计算介质1中的TEm的电场Ey；
    Ey2(:,m) = (cos(kappa(m)*d)+delta(m)/kappa(m)*sin(kappa(m)*d))*exp(gamma(m)*(x2+d));  %计算介质2中的TEm的电场Ey
    Ey3(:,m) = exp(-delta(m)*x3); %计算介质3中的TEm的电场Ey
end
Ey = [Ey2; Ey1; Ey3]; %将3段介质中的Ey，按顺序合并；
Ey = Ey/diag(max(abs(Ey))); %对Ey进行归一化处理
x = [x2' ; x1' ;x3'];     %将3段介质中对应的恒昌按顺序合并
figure;
for m =1:m_te
    plot(x,Ey(:,m),'color',[rand,rand,rand],'Linewidth',2);  %分别对各个模式Ey进行作图
    hold on
end
xlabel('x')
axis([x(1) x(end) -1.1 1.1])
title('TE导模')
hold on
plot([-d,-d],[-1.1,1.1],'black--')
plot([0,0],[-1.1,1.1],'black--')
plot([x(1),x(end)],[0,0],'black--')


%TM导模（软件中的TE）

F_tm = @(x_tm)(x_tm*n_si^2*(n_sio2^2*sqrt(V12^2 - x_tm.^2)+n_sio2^2*sqrt(V13^2-x_tm.^2))./(n_si^2*n_sio2^2*x_tm.^2 - n_si^4*sqrt(V12^2 - x_tm.^2).*sqrt(V13^2 - x_tm.^2) ));  %定义函数
Feigin_tm = @(x_tm)(F_tm(x_tm)-tan(x_tm));   %采用匿名函数的方法定义TM（软件中的TE）模的特征方程
% % 2D 图解法根
% x_tm(1) = fzero(Feigin_tm,3.1);         %求解特征方程的第一个数值解
% x_tm(2) = fzero(Feigin_tm,6.2);         %求解特征方程的第二个数值解
% x_tm(3) = fzero(Feigin_tm,9.285);       %求解特征方程的第三个数值解
% x_tm(4) = fzero(Feigin_tm,12.37);       %求解特征方程的第四个数值解
% x_tm(5) = fzero(Feigin_tm,15.43);       %求解特征方程的第一个数值解
% x_tm(6) = fzero(Feigin_tm,18.44);       %求解特征方程的第二个数值解
% x_tm(7) = fzero(Feigin_tm,21.3);        %求解特征方程的第三个数值解
% x_tm(8) = fzero(Feigin_tm,25.5);        %求解特征方程的第四个数值解
% 2.5D 图解法
x_tm(1) = fzero(Feigin_tm,3.05);         %求解特征方程的第一个数值解
x_tm(2) = fzero(Feigin_tm,6.1);         %求解特征方程的第二个数值解
x_tm(3) = fzero(Feigin_tm,9.14);       %求解特征方程的第三个数值解
x_tm(4) = fzero(Feigin_tm,12.1);       %求解特征方程的第四个数值解
x_tm(5) = fzero(Feigin_tm,15);       %求解特征方程的第一个数值解
x_tm(6) = fzero(Feigin_tm,19.35);       %求解特征方程的第二个数值解
kappa_tm = x_tm/d;                                          %求出对应的 κ 的数值
theta_tm = asin(kappa_tm/(n_si*k));                         %求出对应的 θ 的数值
beta_tm = (n_si*k)*cos(theta_tm);                           %求出对应的 β 的数值
gamma_tm = sqrt((n_si^2-n_sio2^2)*k^2 - kappa_tm.^2);       %求出对应的 γ 的数值
delta_tm = sqrt((n_si^2-n_sio2^2)*k^2 - kappa_tm.^2);       %求出对应的 δ 的数值
neff_tm = beta_tm/k;                %有效折射率

format short g            %设定命令窗口数据显示表格
[x_tm' theta_tm' beta_tm' kappa_tm' gamma_tm' delta_tm' neff_tm']
figure;
ezplot(@tan,[0,20*pi,-5,5])     %作出正切函数tan（x）的曲线
hold on
ezplot(F_tm,[0,20*pi])             %作出函数F(x)的曲线
title('图解法求平板光波导的所需的数据')
% 模场归一化分布
Np = 1001; %设置作图的点数
x2_tm = linspace(-2*d,-d,Np);  %设置介质2中的横坐标范围；
x1_tm = linspace(-d,0,Np);     %设置介质1中的横坐标范围；
x3_tm = linspace(0,1*d,Np);    %设置介质3中的横坐标范围；

Hy1_tm = zeros(Np,3); Hy2_tm = Hy1_tm; Hy3_tm = Hy1_tm; %对3段介质中的Ey分别进行初始化
for m = 1:m_tm      %循环计算各阶TE模，其中m对应TE模的序数；
    Hy1_tm(:,m) = cos(kappa_tm(m)*x1_tm)-delta_tm(m)/kappa_tm(m)*sin(kappa_tm(m)*x1_tm);  %计算介质1中的TEm的电场Ey；
    Hy2_tm(:,m) = (cos(kappa_tm(m)*d)+delta_tm(m)/kappa_tm(m)*sin(kappa_tm(m)*d))*exp(gamma_tm(m)*(x2_tm+d));  %计算介质2中的TEm的电场Ey
    Hy3_tm(:,m) = exp(-delta_tm(m)*x3_tm); %计算介质3中的TEm的电场Ey
end
Hy_tm = [Hy2_tm; Hy1_tm; Hy3_tm];       %将3段介质中的Ey，按顺序合并；
Hy_tm = Hy_tm/diag(max(abs(Hy_tm)));	%对Ey进行归一化处理
x_tm = [x2_tm' ; x1_tm' ;x3_tm'];       %将3段介质中对应的横场按顺序合并
figure;
for m =1:m_tm
    plot(x,Hy_tm(:,m),'color',[rand,rand,rand],'Linewidth',2);  %分别对各个模式Hy进行作图
    hold on
end
xlabel('x')
axis([x_tm(1) x_tm(end) -1.1 1.1])
title('TM导模')
hold on
plot([-d,-d],[-1.1,1.1],'black--')
plot([0,0],[-1.1,1.1],'black--')
plot([x_tm(1),x_tm(end)],[0,0],'black--')

%一个固定 d 的结构导模都已经求出，现在需要的是各个导模的所占的成分（从中间打的光有奇数模，偶数模很小）


%% 直接使用cloudfdtd软件计算的neff和mode expansion的值对一分二的mmi的输出位置进行计算；
% 只考虑一阶模和三阶模（二阶模十分小）忽略其他的高解模的影响
lambda = 1.550;
wg_in = 0.5;
mmi_w = 3.0967;  
n_si = 3.472000;  %index of si
%n_si = 2.843475;  %2.5D 等效
n_sio2=1.444000;  %index of sio2

% Mode# (1-10)(2.5D)使用si材料进行的2.5D的仿真
mode_te_25 = [1.000000e+000, 2.000000e+000, 3.000000e+000, 4.000000e+000, 5.000000e+000, 6.000000e+000, 7.000000e+000, 8.000000e+000, 9.000000e+000, 1.000000e+001, 1.100000e+001, 1.200000e+001, 1.300000e+001, 1.400000e+001, 1.500000e+001];

% neff - neff(Abs) ((1e0)) (1-15)
neff_te_25 = [1.732258e+000, 1.701557e+000, 1.607729e+000, 1.566155e+000, 1.475889e+000, 1.377678e+000, 1.222521e+000, 1.071660e+000, 9.363974e-001, 8.382500e-001, 6.370250e-001, 1.559595e-001, 9.038366e-001, 5.425769e-001, 7.096340e-001];
% Mode# (1-15)
mode_tm_25 = [1.000000e+000, 2.000000e+000, 3.000000e+000, 4.000000e+000, 5.000000e+000, 6.000000e+000, 7.000000e+000, 8.000000e+000, 9.000000e+000, 1.000000e+001, 1.100000e+001, 1.200000e+001, 1.300000e+001, 1.400000e+001, 1.500000e+001];

% neff - neff(Abs) ((1e0)) (1-15)
neff_tm_25 = [1.731124e+000, 1.687844e+000, 1.614389e+000, 1.507422e+000, 1.355699e+000, 1.165065e+000, 9.217118e-001, 7.119244e-001, 5.339490e-001, 3.339784e-001, 8.211427e-001, 1.098638e+000, 1.290134e+000, 1.511291e+000, 1.731315e+000];



x = [1.000000e+000, 2.000000e+000, 3.000000e+000, 4.000000e+000, 5.000000e+000, 6.000000e+000, 7.000000e+000, 8.000000e+000, 9.000000e+000, 1.000000e+001];

% neff - neff(Abs) ((1e0)) (1-10)
neff_2_5 = [2.834112e+000, 2.755381e+000, 2.619203e+000, 2.416544e+000, 2.130217e+000, 1.724685e+000, 1.105973e+000, 6.030287e-001, 1.135963e+000, 1.518260e+000];


% Mode# (1-10)
mode_3 = [1.000000e+000, 2.000000e+000, 3.000000e+000, 4.000000e+000, 5.000000e+000, 6.000000e+000, 7.000000e+000, 8.000000e+000, 9.000000e+000, 1.000000e+001];

% neff - neff(Abs) ((1e0)) (1-10)
neff_3 = [2.831950e+000, 2.753602e+000, 2.618469e+000, 2.418604e+000, 2.140656e+000, 2.095526e+000, 2.005797e+000, 1.853024e+000, 1.769972e+000, 1.634633e+000];


% 这个方法只是使用的mode1和mode3进行计算的长度；
L_2_5_te = 1/2*lambda/(neff_te_25(1)-neff_te_25(3));
L_2_5_tm = 1/2*lambda/(neff_tm_25(1)-neff_tm_25(3));
L_3 = 1/2*lambda/(neff_3(1)-neff_3(3));

%使用 1-N 的对称mmi的结构（这个使用的是文献上的计算公式进行计算的长度）
delta_mmi = 0;  %TE :0  ;TM:1;
We_25 = mmi_w + (lambda/pi)*(n_si/neff_2_5(1))^(2*delta_mmi)*(neff_2_5(1)^2-n_si^2)^(-1/2);
We_3 = mmi_w + (lambda/pi)*(n_si/neff_3(1))^(2*delta_mmi)*(neff_3(1)^2-n_si^2)^(-1/2);
L_pi_25 = 4*n_si*We_25^2/(3*lambda);
L_pi_3 = 4*n_si*We_3^2/(3*lambda);
N = 2;                   %N重像的位置
p_1 = 1;                 %p_1 = 0、1、2.......
p = 1;                   %p = 1、3、5、7.......
L_N_25 = p/N*(3*L_pi_25/4);    %N重像的位置
L_1_25 = p_1*(3*L_pi_25/4);    %1重像的位置
L_N_3 = p/N*(3*L_pi_3/4);    %N重像的位置
L_1_3 = p_1*(3*L_pi_3/4);    %1重像的位置

%使用 2-2 的对称mmi的结构（这个使用的是文献上的计算公式进行计算的长度）
L_N_322 = 1/N*L_pi_3;    %N重像的位置   
L_N_2522 = 1/N*L_pi_25;    %N重像的位置



% %% 一个tetm无关的mmi
% clear all;
% 
% % g (1-20)
% x1 = [0.000000e+000, 5.263158e-003, 1.052632e-002, 1.578947e-002, 2.105263e-002, 2.631579e-002, 3.157895e-002, 3.684211e-002, 4.210526e-002, 4.736842e-002, 5.263158e-002, 5.789474e-002, 6.315789e-002, 6.842105e-002, 7.368421e-002, 7.894737e-002, 8.421053e-002, 8.947368e-002, 9.473684e-002, 1.000000e-001];
% 
% % neff1 - neff_1(Abs) ((1e0)) (1-20)
% d1 = [2.822020e+000, 2.792520e+000, 2.710760e+000, 2.429810e+000, 2.193460e+000, 1.964320e+000, 1.878270e+000, 1.799030e+000, 1.737490e+000, 1.679530e+000, 1.621260e+000, 1.591890e+000, 1.552030e+000, 1.520680e+000, 1.487730e+000, 1.468550e+000, 1.442750e+000, 1.435310e+000, 1.403080e+000, 1.405930e+000];
% 
% x3 = [0.000000e+000, 5.263158e-003, 1.052632e-002, 1.578947e-002, 2.105263e-002, 2.631579e-002, 3.157895e-002, 3.684211e-002, 4.210526e-002, 4.736842e-002, 5.263158e-002, 5.789474e-002, 6.315789e-002, 6.842105e-002, 7.368421e-002, 7.894737e-002, 8.421053e-002, 8.947368e-002, 9.473684e-002, 1.000000e-001];
% 
% % neff3 - neff_3(Abs) ((1e0)) (1-20)
% d3 = [2.644490e+000, 2.626140e+000, 2.555320e+000, 2.313280e+000, 1.933330e+000, 1.879530e+000, 1.783140e+000, 1.711830e+000, 1.623930e+000, 1.604350e+000, 1.552830e+000, 1.544430e+000, 1.500020e+000, 1.466700e+000, 1.434060e+000, 1.409290e+000, 1.398130e+000, 1.375930e+000, 1.363110e+000, 1.352850e+000];
% 
% x_tm1 = [0.000000e+000, 5.263158e-003, 1.052632e-002, 1.578947e-002, 2.105263e-002, 2.631579e-002, 3.157895e-002, 3.684211e-002, 4.210526e-002, 4.736842e-002, 5.263158e-002, 5.789474e-002, 6.315789e-002, 6.842105e-002, 7.368421e-002, 7.894737e-002, 8.421053e-002, 8.947368e-002, 9.473684e-002, 1.000000e-001];
% 
% % neff1 - neff_1(Abs) ((1e0)) (1-20)
% d_tm1 = [1.947470e+000, 1.939790e+000, 1.916660e+000, 1.870240e+000, 1.826650e+000, 1.799260e+000, 1.776270e+000, 1.754900e+000, 1.733240e+000, 1.713930e+000, 1.694780e+000, 1.677730e+000, 1.660410e+000, 1.645150e+000, 1.629630e+000, 1.615640e+000, 1.602820e+000, 1.590330e+000, 1.577700e+000, 1.564620e+000];
% 
% x_tm3 = [0.000000e+000, 5.263158e-003, 1.052632e-002, 1.578947e-002, 2.105263e-002, 2.631579e-002, 3.157895e-002, 3.684211e-002, 4.210526e-002, 4.736842e-002, 5.263158e-002, 5.789474e-002, 6.315789e-002, 6.842105e-002, 7.368421e-002, 7.894737e-002, 8.421053e-002, 8.947368e-002, 9.473684e-002, 1.000000e-001];
% 
% % neff3 - neff_3(Abs) ((1e0)) (1-20)
% d_tm3 = [1.740480e+000, 1.749750e+000, 1.739520e+000, 1.705210e+000, 1.672350e+000, 1.659650e+000, 1.643360e+000, 1.629710e+000, 1.615630e+000, 1.601080e+000, 1.588060e+000, 1.580360e+000, 1.567560e+000, 1.555110e+000, 1.544900e+000, 1.535240e+000, 1.525350e+000, 1.516080e+000, 1.507900e+000, 1.489010e+000];
% 
% figure;
% plot(x1, d1,x3,d3,x_tm1,d_tm1,x_tm3,d_tm3);
% xlabel('slot');
% ylabel('neff1');
% legend('te Abs(neff_1)','te Abs(neff_3)','tm1','tm3');
% 
% 
% clear all;
% 
% % Mode# (1-10)
% x1 = [1.000000e+000, 2.000000e+000, 3.000000e+000, 4.000000e+000, 5.000000e+000, 6.000000e+000, 7.000000e+000, 8.000000e+000, 9.000000e+000, 1.000000e+001];
% 
% % Mode Pz - T(Abs^2) ((1e0)) (1-10)
% d1 = [3.054255e-001, 5.663895e-004, 2.753102e-001, 1.387741e-003, 2.809926e-001, 4.958892e-004, 3.962575e-002, 1.054396e-004, 2.079417e-003, 1.503775e-005];
% 
% x2 = [1.000000e+000, 2.000000e+000, 3.000000e+000, 4.000000e+000, 5.000000e+000, 6.000000e+000, 7.000000e+000, 8.000000e+000, 9.000000e+000, 1.000000e+001];
% 
% % Mode Pz - T(Abs^2) ((1e0)) (1-10)
% d2 = [4.791537e-001, 3.741342e-012, 3.033372e-001, 2.643439e-011, 1.556392e-001, 1.090593e-010, 3.141013e-002, 1.287709e-011, 4.809490e-003, 0];
% 
% % visualization 
% figure;
% plot(x1, d1,x2,d2);
% xlabel('Mode#');
% ylabel('Mode Pz');
% legend('te','tm');





